## Data structure

In [5]:
import pandas as pd

In [6]:
data = [1,2,3,4,5]

In [7]:
s = pd.Series(data)
s

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [8]:
index = ['Linha'+str(i) for i in range(5)]

In [9]:
index

['Linha0', 'Linha1', 'Linha2', 'Linha3', 'Linha4']

In [11]:
s = pd.Series(data = data, index = index)
s

Linha0    1
Linha1    2
Linha2    3
Linha3    4
Linha4    5
dtype: int64

In [13]:
data = {'Linha'+str(i) : i+1 for i in range(5)}
#Create dictionary wheree keys are Linha1, Linha2 and the value is the i 
data

{'Linha0': 1, 'Linha1': 2, 'Linha2': 3, 'Linha3': 4, 'Linha4': 5}

In [15]:
#Turining into series
ss = pd.Series(data)
ss

Linha0    1
Linha1    2
Linha2    3
Linha3    4
Linha4    5
dtype: int64

### We can sum, multiply, divide Series

In [17]:
s1 = s+2
s2 = s1+1
s2

Linha0    4
Linha1    5
Linha2    6
Linha3    7
Linha4    8
dtype: int64

In [18]:
data = [[1,2,3],[4,5,6],[7,8,9]]

In [20]:
df1 = pd.DataFrame(data)
df1

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [32]:
index = ['Linha'+str(i) for i in range(3) ]
columns = ['Linha'+str(i) for i in range(3) ]

df1 = pd.DataFrame(data, index=index, columns=columns)
df1

        Linha0  Linha1  Linha2
Linha0       1       2       3
Linha1       4       5       6
Linha2       7       8       9

In [50]:
data = {'Coluna0': {'Linha0': 1, 'Linha1': 4, 'Linha2': 7},
        'Coluna1': {'Linha0': 2, 'Linha1': 5, 'Linha2': 8},
        'Coluna2': {'Linha0': 3, 'Linha1': 6, 'Linha2': 9}}
data
df1= pd.DataFrame(data)

In [36]:
df2 = pd.DataFrame(data)
df2

        Coluna0  Coluna1  Coluna2
Linha0        1        2        3
Linha1        4        5        6
Linha2        7        8        9

In [40]:
## We can do that with Tuples as well
data_tuples = [(1,2,3),(4,5,6),(7,8,9)]
df3 = pd.DataFrame(data_tuples, index = index, columns = columns)
df3

        Linha0  Linha1  Linha2
Linha0       1       2       3
Linha1       4       5       6
Linha2       7       8       9

In [51]:
#Concatenate DataFrame
df1 [df1 > 0] = 'A'
df1

       Coluna0 Coluna1 Coluna2
Linha0       A       A       A
Linha1       A       A       A
Linha2       A       A       A

In [46]:
#Concatenate DataFrame
df2 [df2 > 0] = 'B'
df2

       Coluna0 Coluna1 Coluna2
Linha0       B       B       B
Linha1       B       B       B
Linha2       B       B       B

In [47]:
#Concatenate DataFrame
df3 [df3 > 0] = 'C'
df3

       Linha0 Linha1 Linha2
Linha0      C      C      C
Linha1      C      C      C
Linha2      C      C      C

In [53]:
#Contatenate it using columns as the mapping
#Dataframe can have the same label for different rows
df4= pd.concat([df1,df2,df3])
df4

       Coluna0 Coluna1 Coluna2 Linha0 Linha1 Linha2
Linha0       A       A       A    NaN    NaN    NaN
Linha1       A       A       A    NaN    NaN    NaN
Linha2       A       A       A    NaN    NaN    NaN
Linha0       B       B       B    NaN    NaN    NaN
Linha1       B       B       B    NaN    NaN    NaN
Linha2       B       B       B    NaN    NaN    NaN
Linha0     NaN     NaN     NaN      C      C      C
Linha1     NaN     NaN     NaN      C      C      C
Linha2     NaN     NaN     NaN      C      C      C

In [55]:
df5= pd.concat([df1,df2,df3], axis=1)
df5

       Coluna0 Coluna1 Coluna2 Coluna0 Coluna1 Coluna2 Linha0 Linha1 Linha2
Linha0       A       A       A       B       B       B      C      C      C
Linha1       A       A       A       B       B       B      C      C      C
Linha2       A       A       A       B       B       B      C      C      C

In [58]:
dados = [[1, 2, 3], [4, 5, 6]]
index = 'X,Y'.split(',')
columns = list('CBA')[::-1]
df = pd.DataFrame(dados, index, columns)
df

   A  B  C
X  1  2  3
Y  4  5  6